Merge pull request #5 from mohammed-murad-alqabal/feature/core-mvp-stabilization-assessment
